# Задание №17320
## Логическая функция F задаётся выражением ((x ∧ y) ∨ (y ∧ z)) ≡ ((x → w) ∧ (w → z)). Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F. Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.
    print("x y z w")
    for x in range(0, 2):
     for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if ((x and y) or (y and z)) == ((x <= w) and (w <= z)):
                    print(x, y, z, w)

# Задание №18483
## Логическая функция F задаётся выражением ((y → w) ≡ (x → ¬z)) ∧ (x ∨ w). Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F. Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.
    print("x y z w")
    for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if not(((y <= w) == (x <= (not z))) and (x or w)):
                    print(x, y, z, w)

# Задание №18550
## Логическая функция F задаётся выражением ((y → z) ∨ (¬x ∧ w)) ≡ (w ≡ z). Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F. Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.
     print("x y z w")
    for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if ((y <= z) or (not x and w)) == (w == z):
                    print(x, y, z, w)

# Задание №59744
## Евгений составляет 6-⁠буквенные слова из букв М, У, Ж, Ч, И, Н, А. Каждая из букв может встречаться в слове ровно один раз, причём первой буквой не может быть Ч, буква Ж должна встречаться не менее 1 раза и номер слова должен быть нечётный. Сколько различных слов может составить Евгений?
    from itertools import *
    c = 0
    count = 0
    for w in product('МУЖЧИНА', repeat=6):
    if w.count('Ж')==1 and w[0]!='Ч' and (w.count('М')<2) and (w.count('У')<2) and (w.count('Ч')<2) and (w.count('И')<2) and (w.count('Н')<2) and (w.count('А')<2):
        c += 1
        if c % 2 != 0:
            count += 1
    print(count)
# Ответ: 1860

# Задание №27268
## Руслан составляет 6-⁠буквенные коды из букв Р, У, С, Л, А, Н. Каждую букву нужно использовать ровно один раз, при этом нельзя ставить рядом две гласные. Сколько различных кодов может составить Руслан?
    import itertools
    alphabet = "РУСЛАН"
    vol = "УА"
    ar = itertools.permutations(alphabet) #Перестановка
    arl = []
    for e in ar:
    arl.append(list(e))
    count = 0
    for e in arl:
    flag = True
    for i in range(len(e)-1):
        if e[i] in vol and e[i+1] in vol:
            flag = False
    if flag:
        count += 1
    print(count)
# Ответ: 480

# Задание №3233
## Все 5-⁠буквенные слова, составленные из букв А, К, Р, У, записаны в алфавитном порядке. Вот начало списка:

## 1.  ААААА

## 2.  ААААК

## 3.  ААААР

## 4.  ААААУ

## 5.  АААКА

# Запишите слово, которое стоит на 250-⁠м месте от начала списка.

    a = {0: "А", 1: "К", 2: "Р", 3: "У"}
    k = 0
    for i in range(0, len(a)):
    for j in range(0, len(a)):
        for g in range(0, len(a)):
            for m in range(0, len(a)):
                for n in range(0, len(a)):
                    k += 1
                    if k == 250:
                        print(a[i], a[j], a[g], a[m], a[n], end=" ")

# Ответ: A Y Y P K
